nanoframework/nf-interpreter/targets/ESP32/_nanoCLR/System.IO.Ports/sys_io_ser_native_System_IO_Ports_SerialPort.cpp
        // setup configuration
        // baud rate
        uart_config.baud_rate = (uint32_t)pThis[FIELD___baudRate].NumericByRef().s4;

        // data bits
        switch ((uint16_t)pThis[FIELD___dataBits].NumericByRef().s4)
        {
            case 5:
                uart_config.data_bits = UART_DATA_5_BITS;
                break;

            case 6:
                uart_config.data_bits = UART_DATA_6_BITS;
                break;

            case 7:
                uart_config.data_bits = UART_DATA_7_BITS;
                break;

            case 8:
                uart_config.data_bits = UART_DATA_8_BITS;
                break;

            default:
                NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
        }

        // parity
        switch ((Parity)pThis[FIELD___parity].NumericByRef().s4)
        {
            default:
            case Parity_None:
                uart_config.parity = UART_PARITY_DISABLE;
                break;

            case Parity_Even:
                uart_config.parity = UART_PARITY_EVEN;
                break;

            case Parity_Odd:
                uart_config.parity = UART_PARITY_ODD;
                break;
        }

        // stop bits
        switch ((StopBits)pThis[FIELD___stopBits].NumericByRef().s4)
        {
            default:
            case StopBits_One:
                uart_config.stop_bits = UART_STOP_BITS_1;
                break;

            case StopBits_OnePointFive:
                uart_config.stop_bits = UART_STOP_BITS_1_5;
                break;

            case StopBits_Two:
                uart_config.stop_bits = UART_STOP_BITS_2;
                break;
        }

        uart_config.rx_flow_ctrl_thresh = 120;

        bool EnableXonXoff = false;
        switch ((Handshake)pThis[FIELD___handshake].NumericByRef().s4)
        {
            default:
            case Handshake_None:
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
                break;

            case Handshake_RequestToSend:
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_RTS;
                uart_config.rx_flow_ctrl_thresh = 122;
                break;

            case Handshake_RequestToSendXOnXOff:
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_RTS;
                uart_config.rx_flow_ctrl_thresh = 122;
                EnableXonXoff = true;
                break;

            case Handshake_XOnXOff:
                EnableXonXoff = true;
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
                break;
        }

        bool rs485Mode = ((SerialMode)pThis[FIELD___mode].NumericByRef().s4 == SerialMode_RS485);
        if (rs485Mode)
        {
            // Disable any flow control & Set RS485 half duplex mode
            uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
            uart_set_mode(uart_num, UART_MODE_RS485_HALF_DUPLEX);
        }
        else
        {
            // Reset to normal mode
            uart_set_mode(uart_num, UART_MODE_UART);
        }

        // Already Initialised ?
        if (GetPalUartFromUartNum_sys(uart_num)->SerialDevice)
        {
            int errors = 0;

            errors += uart_set_word_length(uart_num, uart_config.data_bits);
            errors += uart_set_baudrate(uart_num, uart_config.baud_rate);
            errors += uart_set_parity(uart_num, uart_config.parity);
            errors += uart_set_stop_bits(uart_num, uart_config.stop_bits);
            errors += uart_set_hw_flow_ctrl(uart_num, uart_config.flow_ctrl, uart_config.rx_flow_ctrl_thresh);
            if (errors)
            {
                ESP_LOGE(TAG, "Failed to set UART parameters configuration");
                NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
            }
        }
        else
        {
            // First time make sure UART is reset so use uart_param_config.
            // If you call this once driver installed it resets UART and stop events ISR being called.
            if (uart_param_config(uart_num, &uart_config) != ESP_OK)
            {
                ESP_LOGE(TAG, "Failed to set UART parameters configuration");
                NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
            }
        }

        if (EnableXonXoff)
        {
            uart_set_sw_flow_ctrl(uart_num, true, 20, 40);
        }

        // Map to currently assigned pins
        int txPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Tx);
        int rxPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Rx);
        int rtsPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Rts);
        int ctsPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Cts);

        // check if TX, RX pins have been previously set
        if (txPin == UART_PIN_NO_CHANGE || rxPin == UART_PIN_NO_CHANGE)
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_PIN_UNAVAILABLE);
        }

        // Don't use RTS/CTS pins if no hardware handshake enabled unless in RS485 mode
        if (rs485Mode)
        {
            ctsPin = UART_PIN_NO_CHANGE; // no need for a CTS pin enabled, just RTS
        }
        else
        {
            if (uart_config.flow_ctrl == UART_HW_FLOWCTRL_DISABLE)
            {
                rtsPin = UART_PIN_NO_CHANGE;
                ctsPin = UART_PIN_NO_CHANGE;
            }
        }

        if (uart_set_pin(uart_num, txPin, rxPin, rtsPin, ctsPin) != ESP_OK)
        {
            ESP_LOGE(TAG, "Failed to set UART pins");
            NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
        }

        // null pointers and vars
        pThis = NULL;
    }
    NANOCLR_NOCLEANUP();
}

HRESULT Library_sys_io_ser_native_System_IO_Ports_SerialPort::NativeSetWatchChar___VOID(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

    uart_port_t uart_num;
    uint8_t watchChar;

    // get a pointer to the managed object instance and check that it's not NULL
    CLR_RT_HeapBlock *pThis = stack.This();
    FAULT_ON_NULL(pThis);

    if (pThis[FIELD___disposed].NumericByRef().u1 != 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OBJECT_DISPOSED);
    }

